## pandas

- 데이터 분석에 관련된 기능 제공
- 빅데이터를 빠르게 처리
- 데이터의 연산
- 외부 데이터의 처리

In [1]:
%pip install pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/sojung/Library/Python/3.11/lib/python/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (1.25.2)
Requirement already satisfied: six>=1.5 in /Users/sojung/Library/Python/3.11/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: python3 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

Series 타입
- 동일한 성격의 데이터를 나열한 것 (열 하나만 존재)
- 데이터형 : 문자열, 실수, 정수, 카테고리, 시간 등

In [2]:
import pandas as pd

#리스트
data = pd.Series(['서울','부산','대전','대구','광주']) #1차원형태의 데이터는 다 가능 
data 
#key 값을 하는 것이 index이다 (숫자부분)
#index를 이용해서 해당 값을 호출 할 수 있다.

0    서울
1    부산
2    대전
3    대구
4    광주
dtype: object

In [ ]:
#딕셔너리: 키=>Index 적용 
data = pd.Series({1:'서울',2:'부산',3:'대전',4:'대구',5:'광주'})
data

DataFrame
- 데이터 프레임은 테이블형태로 구성된 2차원 데이터구조 
- 행과 열로 이루어져있고 각 열은 서로 다른 데이터타입을 가진다

In [4]:
#list를 이용한 DataFrame생성 (list는 2차원구조)
import pandas as pd

tmp = [[56, 92, 88], [78, 86, 91], [92, 33, 89]]
df = pd.DataFrame(tmp,columns=['국어','영어','수학'])
df

   국어  영어  수학
0  56  92  88
1  78  86  91
2  92  33  89

In [6]:
#dict 를 이용한 dataframe 생성

import pandas as pd

tmp={'이름':['홍길동','김생성', '박이용'],
     '국어':[86,92,71],
     '영어':[88,76,72],
     '수학':[82,73,93],
     
     }

df = pd.DataFrame(tmp) #dict의 key가 열 index(이름)으로 적용
df

    이름  국어  영어  수학
0  홍길동  86  88  82
1  김생성  92  76  73
2  박이용  71  72  93

DataFrame에서 데이터 조회

In [9]:
#열단위 데이터 가져오기 
print(df['이름'])
print(df.이름) #위와 결과는 똑같다

print(df[['이름','수학']]) #2개이상의 열 값 출력

0    홍길동
1    김생성
2    박이용
Name: 이름, dtype: object
0    홍길동
1    김생성
2    박이용
Name: 이름, dtype: object
    이름  수학
0  홍길동  82
1  김생성  73
2  박이용  93

In [10]:
display(df[['이름','수학']]) #display(): 데이터 프레임형 데이터를 서식을 적용해 출력

    이름  수학
0  홍길동  82
1  김생성  73
2  박이용  93

### 행단위 데이터 조회(키 index (맨왼쪽열 고유값), 데이터 index(늘상 부여되는 값))
- index 값
● df.loc[ 인덱스 이름 ]
● df.loc[ [인덱스이름1, 인덱스이름2] ]

- index 위치 (데이터 위치 index)
● df.iloc[인덱스 번호]
● df.iloc[ 시작 : 끝 ]

In [13]:
#행단위 데이터 조회(index값)
df.loc[1, :]

이름    김생성
국어     92
영어     76
수학     73
Name: 1, dtype: object

In [16]:
df.loc[1, '국어']

1    92
2    71
Name: 국어, dtype: int64

In [19]:
display(df.loc[1:2, ['국어','수학']])
display(df.loc[:, ['국어','수학']])

   국어  수학
1  92  73
2  71  93

   국어  수학
0  86  82
1  92  73
2  71  93

In [23]:
# 행/열 단위 데이터 조회(index 위치)
display(df.iloc[0])
display(df.iloc[0, 0])
display(df.iloc[0:2, 0:3])
display(df.iloc[0:2, [0,3,2]]) #보여지는 순서도 바꿀 수 있다.

이름    홍길동
국어     86
영어     88
수학     82
Name: 0, dtype: object

'홍길동'

    이름  국어  영어
0  홍길동  86  88
1  김생성  92  76

    이름  수학  영어
0  홍길동  82  88
1  김생성  73  76

In [27]:
# 행/ 열 Index 수정하기 

#열 index = 열이름(columns)
df.columns 

df.columns = ['name','kor','eng','mat']
df

  name  kor  eng  mat
0  홍길동   86   88   82
1  김생성   92   76   73
2  박이용   71   72   93

In [28]:
#데이터 추가 
df.loc[3]=['이순신',95,85,92]
df

  name  kor  eng  mat
0  홍길동   86   88   82
1  김생성   92   76   73
2  박이용   71   72   93
3  이순신   95   85   92

In [30]:
df.loc[len(df)]=['김코코',95,85,92]
df

  name  kor  eng  mat
0  홍길동   86   88   82
1  김생성   92   76   73
2  박이용   71   72   93
3  이순신   95   85   92
4  이순신   95   85   92
5  김코코   95   85   92

In [35]:
#행 데이터 삭제 
df1=df.copy() #메모리상 각각 다른영역에 저장됨.
df1=df1.drop([2])  #df1.drop([2], inplace=True)

In [36]:
df1

  name  kor  eng  mat
0  홍길동   86   88   82
1  김생성   92   76   73
3  이순신   95   85   92
4  이순신   95   85   92
5  김코코   95   85   92

In [37]:
df1.loc[3]

name    이순신
kor      95
eng      85
mat      92
Name: 3, dtype: object

In [38]:
display(df1.loc[3])
display(df1.iloc[2])

name    이순신
kor      95
eng      85
mat      92
Name: 3, dtype: object

name    이순신
kor      95
eng      85
mat      92
Name: 3, dtype: object

In [ ]:
#열삭제 

df1 = df1.drop([3], axis=0, inplace=True)  # 1 열단위 0 행단위

In [43]:
df1

  name  kor  eng  mat
0  홍길동   86   88   82
1  김생성   92   76   73
4  이순신   95   85   92
5  김코코   95   85   92